#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dhoppeIT/terraform/runs/run-6KD8GrnXUR7UwWTe

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.tfe-organization.tfe_organization.default: Refreshing state... [id=dhoppeIT]
module.tfe-oauth_client.tfe_oauth_client.default: Refreshing state... [id=oc-xYRbQmaEGC5uarMV]
module.tfe-organization.tfe_organization_token.default: Refreshing state... [id=dhoppeIT]
module.tfe-workspace_terraform.tfe_workspace.default: Refreshing state... [id=ws-GJQ35o1gDXhiGfEd]
module.tfe-workspace_aws.tfe_workspace.default: Refreshing state... [id=ws-XbYK7RcCKXKRkwTK]
module.tfe-registry["tfe-variable"].tfe_registry_module.default: Refreshing state... [id=mod-zHW798kCRPoazFex]
module.tfe-registry["tfe-workspace"].tfe_registry_module.default: Refreshing state... [id=mod-HbYAeTqA8KN6MtN8]
module.tfe-registry["tfe-registry"].tfe_registry_module.default: Refreshing state... [id=mod-NFM8JSwZL5Wff5wL]
module.tfe-registry["tfe-notification"].tfe_registry_module.default: Refreshing state... [id=mod-bcLUkHCyBow4uupy]
module.tfe-registry["tfe-oauth_client"].tfe_registry_module.default: Refreshing state... [id=mod-Ru2EyqgfXbxehE6n]
module.tfe-registry["tfe-organization"].tfe_registry_module.default: Refreshing state... [id=mod-bW3nfHoYKae4Q8Mr]
module.tfe-variable_aws["slack_webhook_url"].tfe_variable.default: Refreshing state... [id=var-q7CbmNn5VZL5fymW]
module.tfe-notification_aws.tfe_notification_configuration.default: Refreshing state... [id=nc-P163HR27RKaawFvu]
module.tfe-notification_terraform.tfe_notification_configuration.default: Refreshing state... [id=nc-f8unHT1ZpXgAAV8J]
module.tfe-variable_terraform["slack_webhook_url"].tfe_variable.default: Refreshing state... [id=var-pRxngddMDqccnDXB]
module.tfe-variable_terraform["github_token"].tfe_variable.default: Refreshing state... [id=var-z87ZidK8NvhY9b9S]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.tfe-organization.tfe_organization_token.default has been deleted
  - resource "tfe_organization_token" "default" {
      - force_regenerate = false -> null
      - id               = "dhoppeIT" -> null
      - organization     = "dhoppeIT" -> null
      - token            = (sensitive value)
    }
  # module.tfe-variable_terraform["slack_webhook_url"].tfe_variable.default has been deleted
  - resource "tfe_variable" "default" {
      - category     = "terraform" -> null
      - description  = "The destination URL used to send Slack notifications" -> null
      - hcl          = false -> null
      - id           = "var-pRxngddMDqccnDXB" -> null
      - key          = "slack_webhook_url" -> null
      - sensitive    = true -> null
      - value        = (sensitive value)
      - workspace_id = "ws-GJQ35o1gDXhiGfEd" -> null
    }
  # module.tfe-workspace_terraform.tfe_workspace.default has been changed
  ~ resource "tfe_workspace" "default" {
        id                            = "ws-GJQ35o1gDXhiGfEd"
        name                          = "terraform"
      + remote_state_consumer_ids     = []
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.tfe-variable_aws["slack_webhook_url"].tfe_variable.default has been deleted
  - resource "tfe_variable" "default" {
      - category     = "terraform" -> null
      - description  = "The destination URL used to send Slack notifications" -> null
      - hcl          = false -> null
      - id           = "var-q7CbmNn5VZL5fymW" -> null
      - key          = "slack_webhook_url" -> null
      - sensitive    = true -> null
      - value        = (sensitive value)
      - workspace_id = "ws-XbYK7RcCKXKRkwTK" -> null
    }
  # module.tfe-notification_aws.tfe_notification_configuration.default has been deleted
  - resource "tfe_notification_configuration" "default" {
      - destination_type = "slack" -> null
      - email_addresses  = [] -> null
      - email_user_ids   = [] -> null
      - enabled          = true -> null
      - id               = "nc-P163HR27RKaawFvu" -> null
      - name             = "slack" -> null
      - triggers         = [
          - "run:errored",
          - "run:needs_attention",
        ] -> null
      - url              = "https://hooks.slack.com/services/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" -> null
      - workspace_id     = "ws-XbYK7RcCKXKRkwTK" -> null
    }
  # module.tfe-variable_terraform["github_token"].tfe_variable.default has been deleted
  - resource "tfe_variable" "default" {
      - category     = "terraform" -> null
      - description  = "The token used to authenticate with GitHub" -> null
      - hcl          = false -> null
      - id           = "var-z87ZidK8NvhY9b9S" -> null
      - key          = "github_token" -> null
      - sensitive    = true -> null
      - value        = (sensitive value)
      - workspace_id = "ws-GJQ35o1gDXhiGfEd" -> null
    }
  # module.tfe-workspace_aws.tfe_workspace.default has been changed
  ~ resource "tfe_workspace" "default" {
        id                            = "ws-XbYK7RcCKXKRkwTK"
        name                          = "aws"
      + remote_state_consumer_ids     = []
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.tfe-oauth_client.tfe_oauth_client.default has been deleted
  - resource "tfe_oauth_client" "default" {
      - api_url          = "https://api.github.com" -> null
      - http_url         = "https://github.com" -> null
      - id               = "oc-xYRbQmaEGC5uarMV" -> null
      - oauth_token      = (sensitive value)
      - oauth_token_id   = "ot-UsrZtScDe6mpXLPo" -> null
      - organization     = "dhoppeIT" -> null
      - service_provider = "github" -> null
    }
  # module.tfe-notification_terraform.tfe_notification_configuration.default has been deleted
  - resource "tfe_notification_configuration" "default" {
      - destination_type = "slack" -> null
      - email_addresses  = [] -> null
      - email_user_ids   = [] -> null
      - enabled          = true -> null
      - id               = "nc-f8unHT1ZpXgAAV8J" -> null
      - name             = "slack" -> null
      - triggers         = [
          - "run:errored",
          - "run:needs_attention",
        ] -> null
      - url              = "https://hooks.slack.com/services/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" -> null
      - workspace_id     = "ws-GJQ35o1gDXhiGfEd" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.tfe-notification_aws.tfe_notification_configuration.default will be created
  + resource "tfe_notification_configuration" "default" {
      + destination_type = "slack"
      + email_addresses  = (known after apply)
      + email_user_ids   = (known after apply)
      + enabled          = true
      + id               = (known after apply)
      + name             = "slack"
      + triggers         = [
          + "run:errored",
          + "run:needs_attention",
        ]
      + url              = (sensitive)
      + workspace_id     = "ws-XbYK7RcCKXKRkwTK"
    }

  # module.tfe-notification_terraform.tfe_notification_configuration.default will be created
  + resource "tfe_notification_configuration" "default" {
      + destination_type = "slack"
      + email_addresses  = (known after apply)
      + email_user_ids   = (known after apply)
      + enabled          = true
      + id               = (known after apply)
      + name             = "slack"
      + triggers         = [
          + "run:errored",
          + "run:needs_attention",
        ]
      + url              = (sensitive)
      + workspace_id     = "ws-GJQ35o1gDXhiGfEd"
    }

  # module.tfe-oauth_client.tfe_oauth_client.default will be created
  + resource "tfe_oauth_client" "default" {
      + api_url          = "https://api.github.com"
      + http_url         = "https://github.com"
      + id               = (known after apply)
      + oauth_token      = (sensitive value)
      + oauth_token_id   = (known after apply)
      + organization     = "dhoppeIT"
      + service_provider = "github"
    }

  # module.tfe-organization.tfe_organization_token.default will be created
  + resource "tfe_organization_token" "default" {
      + force_regenerate = false
      + id               = (known after apply)
      + organization     = "dhoppeIT"
      + token            = (sensitive value)
    }

  # module.tfe-registry["tfe-notification"].tfe_registry_module.default must be replaced
-/+ resource "tfe_registry_module" "default" {
      ~ id              = "mod-bcLUkHCyBow4uupy" -> (known after apply)
      ~ module_provider = "tfe" -> (known after apply)
      ~ name            = "notification" -> (known after apply)
      ~ organization    = "dhoppeIT" -> (known after apply)

      ~ vcs_repo {
          ~ oauth_token_id     = "ot-UsrZtScDe6mpXLPo" -> (known after apply) # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.tfe-registry["tfe-oauth_client"].tfe_registry_module.default must be replaced
-/+ resource "tfe_registry_module" "default" {
      ~ id              = "mod-Ru2EyqgfXbxehE6n" -> (known after apply)
      ~ module_provider = "tfe" -> (known after apply)
      ~ name            = "oauth_client" -> (known after apply)
      ~ organization    = "dhoppeIT" -> (known after apply)

      ~ vcs_repo {
          ~ oauth_token_id     = "ot-UsrZtScDe6mpXLPo" -> (known after apply) # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.tfe-registry["tfe-organization"].tfe_registry_module.default must be replaced
-/+ resource "tfe_registry_module" "default" {
      ~ id              = "mod-bW3nfHoYKae4Q8Mr" -> (known after apply)
      ~ module_provider = "tfe" -> (known after apply)
      ~ name            = "organization" -> (known after apply)
      ~ organization    = "dhoppeIT" -> (known after apply)

      ~ vcs_repo {
          ~ oauth_token_id     = "ot-UsrZtScDe6mpXLPo" -> (known after apply) # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.tfe-registry["tfe-registry"].tfe_registry_module.default must be replaced
-/+ resource "tfe_registry_module" "default" {
      ~ id              = "mod-NFM8JSwZL5Wff5wL" -> (known after apply)
      ~ module_provider = "tfe" -> (known after apply)
      ~ name            = "registry" -> (known after apply)
      ~ organization    = "dhoppeIT" -> (known after apply)

      ~ vcs_repo {
          ~ oauth_token_id     = "ot-UsrZtScDe6mpXLPo" -> (known after apply) # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.tfe-registry["tfe-variable"].tfe_registry_module.default must be replaced
-/+ resource "tfe_registry_module" "default" {
      ~ id              = "mod-zHW798kCRPoazFex" -> (known after apply)
      ~ module_provider = "tfe" -> (known after apply)
      ~ name            = "variable" -> (known after apply)
      ~ organization    = "dhoppeIT" -> (known after apply)

      ~ vcs_repo {
          ~ oauth_token_id     = "ot-UsrZtScDe6mpXLPo" -> (known after apply) # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.tfe-registry["tfe-workspace"].tfe_registry_module.default must be replaced
-/+ resource "tfe_registry_module" "default" {
      ~ id              = "mod-HbYAeTqA8KN6MtN8" -> (known after apply)
      ~ module_provider = "tfe" -> (known after apply)
      ~ name            = "workspace" -> (known after apply)
      ~ organization    = "dhoppeIT" -> (known after apply)

      ~ vcs_repo {
          ~ oauth_token_id     = "ot-UsrZtScDe6mpXLPo" -> (known after apply) # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.tfe-variable_aws["slack_webhook_url"].tfe_variable.default will be created
  + resource "tfe_variable" "default" {
      + category     = "terraform"
      + description  = "The destination URL used to send Slack notifications"
      + hcl          = false
      + id           = (known after apply)
      + key          = "slack_webhook_url"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = "ws-XbYK7RcCKXKRkwTK"
    }

  # module.tfe-variable_terraform["github_token"].tfe_variable.default will be created
  + resource "tfe_variable" "default" {
      + category     = "terraform"
      + description  = "The token used to authenticate with GitHub"
      + hcl          = false
      + id           = (known after apply)
      + key          = "github_token"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = "ws-GJQ35o1gDXhiGfEd"
    }

  # module.tfe-variable_terraform["slack_webhook_url"].tfe_variable.default will be created
  + resource "tfe_variable" "default" {
      + category     = "terraform"
      + description  = "The destination URL used to send Slack notifications"
      + hcl          = false
      + id           = (known after apply)
      + key          = "slack_webhook_url"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = "ws-GJQ35o1gDXhiGfEd"
    }

  # module.tfe-workspace_aws.tfe_workspace.default will be updated in-place
  ~ resource "tfe_workspace" "default" {
        id                            = "ws-XbYK7RcCKXKRkwTK"
        name                          = "aws"
        # (15 unchanged attributes hidden)

      ~ vcs_repo {
          ~ oauth_token_id     = "ot-UsrZtScDe6mpXLPo" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.tfe-workspace_terraform.tfe_workspace.default will be updated in-place
  ~ resource "tfe_workspace" "default" {
        id                            = "ws-GJQ35o1gDXhiGfEd"
        name                          = "terraform"
        # (15 unchanged attributes hidden)

      ~ vcs_repo {
          ~ oauth_token_id     = "ot-UsrZtScDe6mpXLPo" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 13 to add, 2 to change, 6 to destroy.


```

</details>

*Pusher: @dhoppe, Action: `pull_request`*